{
    "pageFactory_bootstrap": {
        "description": "pageFactory (Bootstrap) is a web application that utilizes the Page Factory design pattern in Selenium WebDriver to enhance the maintainability and readability of test scripts. It leverages Bootstrap for responsive and modern UI design, making it easier to create and manage web elements in automated tests."
    },
    "pageFactory_next": {
        "description": ""
    },
    "objectViewer": {
        "description": ""
    },
    "orangeStats": {
        "description": "<h2>Topic Selection Background</h2><p>  While watching 2025 MLB, which was ending in the process of selecting a topic, I felt difficulty in comparing MLB statistics and others, so I am working on this project to solve this problem.</p><h2>Project Overview</h2><h3>Project Stack</h3><ul><li><b>Next.js:</b> It is a React-based full stack web framework that supports Server Side Rendering<sub>(SSR)</sub> and Static Site Generation. When I conceived the initial project, I approached it using the React+Spring boot method, which I chose Next.js because I expected this to significantly reduce the speed.</li><li><b>TiDB Cloud:</b> TiDB is a service closer to NewSQL than relational databases like MySQL. TiDB Cloud is a service that provides TiDB in cloud environments such as AWS, and I used it because Free Tier services were not burdensome.</li><li><b>Vercel:</b> Vercel, which is also the developer of Next.js, provides a static home page and Serverless Function. In addition, I utilized the Next.js project with the idea that projects can be imported and distributed from GitHub without complicated settings.</li></ul><h3>Implementation Method</h3><p>  The homepage can be largely divided into a homepage server powered by Vercel, a database powered by TiDB Cloud, and an API operated by Major League Baseball.</p><p>  The homepage is powered by the Next.js framework and operated by JSX grammar, which will be described later because it will get longer when solved here.</p><p>  MLB has implemented the homepage through API for various information<sub>(player, team, game information, etc.)</sub>, and the data that does not change often<sub>(player information, team information, stadium information, etc.)</sub> is stored in the database. In the case of frequently changing data<sub>(player's current season record, team's current season record, etc.)</sub> or data<sub>(player's past record, etc.)</sub> that can be burdensome to the DB, it was implemented by fetching data directly from the API without storing it in the DB.</p><p>  Other details will be described in the detailed page information and database items.</p><h2>Database</h2><p>  The database is powered by TiDB Cloud, and the schema is as follows.</p><p>  The data was largely divided into information retrieved from the database and information retrieved from the API. The database contains the information above, plus an additional database containing award information.</p><h2>Future Improvements</h2><ul><li>I didn't add automatic translation of English content in this project, but I want to improve this part through API such as Google Translate API in the future.</li><li>Some pages may not look normal in mobile environment, so I want to improve this part. When this work is finished, I would like to consider developing a Cross Platform mobile application through React Native using React grammar.</li></ul>"
    }
}